code-review/NRB_3471_3546/База_Стало/Documents/ФормированиеОтчетаВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ФормированиеОтчетаВыписки</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий350</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Comment>Ценная бумага</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСостояниюНа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ФормированиеОтчетаВыписки/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	СтандартнаяОбработка = Ложь;
	Если РучнойВвод Тогда
		Возврат;
	КонецЕсли;
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс, ПометкаУдаления);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверки реквизитов
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если НЕ ЗначениеЗаполнено(СчетДепо) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не выбран 'Счет депо'", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
	Если ЭтоНовый() Тогда
		Если НЕ ЗначениеЗаполнено(Автор) Тогда
			Автор = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		Изменил	= Справочники.Пользователи.ПустаяСсылка();
	Иначе
		Изменил	= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание, СтандартнаяОбработка)
	Если Основание = Неопределено Тогда
		ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), , );
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение")
		И ТипЗнч(Основание.ВидОперацииД) = Тип("ПеречислениеСсылка.ВидыОтчетов") Тогда
		Дата				= ОбщегоНазначения.ДатаДокумента(Основание);
		Автор				= ПараметрыСеанса.ТекущийПользователь;
		ВидОтчета			= Основание.ВидОперацииД;
		Депонент			= Основание.СчетДепо.Владелец;
		ДокументОснование	= Основание.Ссылка;
		Инициатор			= Основание.Инициатор;
		Комментарий			= Основание.Комментарий;
		СчетДепо			= Основание.СчетДепо;
		Если Основание.ВидОперацииД = Перечисления.ВидыОтчетов.ОтчетОбОперацияхПоСчетуДЕПО Тогда
			ЦеннаяБумага = Основание.ЦБУведомление;
		Иначе
			ЦеннаяБумага = Основание.ЦБВыписка;
		КонецЕсли;
	Иначе
		ДокументОснование = Документы.Поручение.ПустаяСсылка();
		ОбщегоНазначения.СообщитьОбОшибке("На основании данного документа нельзя создать '"
			+ Метаданные.Документы.ФормированиеОтчетаВыписки.Синоним + "'.
			|Основание должно быть порученим с одним из видов отчетов.");
	КонецЕсли;
КонецПроцедуры
